Repository: hamadatrichine/nvda-screen-wrapping
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt_br, zh_cn

source: Activates and deactivates the screen wrapping feature.
pt_br: Ativar ou desativar o loop de tela
zh_cn: 开关循环浏览功能

source: wrapping to bottom
pt_br: Voltando ao fim
zh_cn: 底部

source: wrapping to top
pt_br: Voltando ao início
zh_cn: 顶部

source: Screen wrapping off.
pt_br: Loop de tela desativado
zh_cn: 关闭循环浏览

source: Screen wrapping on.
pt_br: Loop de tela ativado
zh_cn: 开启循环浏览

source: Find
pt_br: Buscar
zh_cn: 查找

source: Type the text you wish to find
pt_br: Digite o texto a ser buscado
zh_cn: 请输入您要查找的文本

source: Case &sensitive
pt_br: Distinguir &maiúsculas de minúsculas
zh_cn: 匹配大小写

source: &Wrap around
pt_br: &Busca circular
zh_cn: 循环查找

source: text "%s" not found
pt_br: Texto "%s" não encontrado
zh_cn: 文本 "%s" 无法找到

source: Find Error
pt_br: Erro de busca
zh_cn: 查找失败

source: Not supported in this document
pt_br: Não suportado neste documento
zh_cn: 本文档不支持

source: Screen Wrapping
pt_br: Loop de tela
zh_cn: 循环浏览

source: &Play a beep when wrapping
pt_br: &Tocar um beep ao navegar em loop
zh_cn: 开关 / 循环到首尾时播放风鸣音(&P)

source: &Copy PayPal donation E-mail to clipboard
pt_br: &Copiar e-mail de doação do Paypal para a área de transferência
zh_cn: 复制 PayPal 捐赠账户到剪贴板(&C)

source: Would you like to donate?
zh_cn: 您愿意捐赠该插件吗

source: If you like my work, please consider donating. Any contribution you can give helps me to keep going. My paypal E-mail is hatrichine25@gmail.com. Would you like to copy it to your clipboard? You can always find it under nvda settings/screen wrapping
zh_cn: 如果您喜欢我的作品，请考虑捐赠。 您的支持就是我前进的动力。 我的 Paypal 账户是 hatrichine25@gmail.com 您想将其复制到剪贴板吗？ 您日后还可以在 nvda 设置 > “循环浏览”类别下找到该捐赠方式。

source: screen wrapping for nvda
pt_br: Loop de tela para NVDA
zh_cn: 循环浏览模式

source: This addon brings the screen wrapping feature to nvda. When you press quick navigation keys such as h, b, f and others, you will be placed on the next element regardless of your current position on a webpage. If elements are not found below your position, you will be placed at the first element of the requested type available from the beginning of the page and vice versa when you are searching upwards. this also extends to the find dialog of nvda.
zh_cn: 这个插件为 nvda 增加了循环浏览功能。 在您使用单键导航如 h、b、f 过程中，会向下跳转相应的元素。 如果往下找不到元素，则会从头开始继续按相应元素类型跳转，反之亦然，向上跳转也是如此。 当然，该功能对于 NVDA 的查找功能也试用。
